{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.9", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"min": -0.6725833037320305, "scale": 0.005019278386059929, "dtype": "uint8"}}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.016312674593691734, "scale": 0.008156337296845867, "dtype": "uint8"}}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.2157703659698075, "scale": 0.0019795446419248394, "dtype": "uint8"}}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -1.03059720993042, "scale": 0.007577920661253088, "dtype": "uint8"}}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.33643827718846936, "scale": 0.002951212957793591, "dtype": "uint8"}}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.1794289034955642, "scale": 0.002136058374947193, "dtype": "uint8"}}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.1819109429331387, "scale": 0.0018010984448825612, "dtype": "uint8"}}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.5976763715931014, "scale": 0.004819970738654043, "dtype": "uint8"}}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -0.18258175195432177, "scale": 0.0028528398742862777, "dtype": "uint8"}}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.20076150368241702, "scale": 0.002158725846047495, "dtype": "uint8"}}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.17719967487980337, "scale": 0.002495770068729625, "dtype": "uint8"}}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.18064890036395953, "scale": 0.0017886029739005893, "dtype": "uint8"}}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -0.17920678737116794, "scale": 0.002240084842139599, "dtype": "uint8"}}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.14174636660837658, "scale": 0.0028927829920076856, "dtype": "uint8"}}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"min": -0.12366545971702127, "scale": 0.0017175758294030732, "dtype": "uint8"}}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.14622165473068463, "scale": 0.0018052056139590694, "dtype": "uint8"}}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.10595030150577134, "scale": 0.0017368901886192023, "dtype": "uint8"}}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.08470387511393604, "scale": 0.0010457268532584696, "dtype": "uint8"}}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.12787745893001556, "scale": 0.0015044406932943008, "dtype": "uint8"}}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.19759350839783163, "scale": 0.0021020585999769323, "dtype": "uint8"}}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.11315914199632757, "scale": 0.0011911488631192375, "dtype": "uint8"}}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.34960634918773875, "scale": 0.003884514990974875, "dtype": "uint8"}}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.13678494095802307, "scale": 0.0013410288329217949, "dtype": "uint8"}}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.9140599073148241, "scale": 0.006575970556221757, "dtype": "uint8"}}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -0.09236334176624522, "scale": 0.0014897313188104069, "dtype": "uint8"}}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.5063331942932279, "scale": 0.03894870725332522, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [512, 1024], "dtype": "float32", "quantization": {"min": -0.11703301113025816, "scale": 0.0009215197726791981, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.012926237913323384, "scale": 7.786890309230955e-05, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [1024, 1024], "dtype": "float32", "quantization": {"min": -0.08502114038257039, "scale": 0.0006912287835981332, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.011873131274592642, "scale": 8.02238599634638e-05, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [1024, 512], "dtype": "float32", "quantization": {"min": -0.083458489354919, "scale": 0.0007257259943905999, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.012530243396759034, "scale": 0.00011187717318534851, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [512, 2], "dtype": "float32", "quantization": {"min": -0.116904949148496, "scale": 0.000935239593187968, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.00031574743927693835, "scale": 2.486200309267231e-06, "dtype": "uint8"}}]}]}